package Lab1OOP;

import java.util.Scanner;

public class Variant {
    public static void variant () {
        //Коефіцієнти за допомогою яких вираховують варіант
        int c2_v = 2;
        int c3_v = 3;
        int c5_v = 5;
        int c7_v = 7;
        //Для можливості обчислити будь який варіант, додав можливість вводу даних з клавіатури
        //(В дужках зазначено мій варіант, на випадок, якщо я забуду)
        Scanner scan = new Scanner(System.in);
        System.out.print("Залікова книжка (2303): №");
        Integer nomer = scan.nextInt();
        //Власне, формула обчислення варіанту
        int c2 = nomer % c2_v;
        int c3 = nomer % c3_v;
        int c5 = nomer % c5_v;
        int c7 = nomer % c7_v;
        //Вивід результатів за формулами вище
        System.out.println("\nМої дані для знаходження варіанту: ");
        System.out.println("C2 = " + c2 + ";\n" + "C3 = " + c3 + ";\n" + "C5 = " + c5 + ";\n" + "C7 = " + c7 + ".");
        System.out.println("\nОбчислення варіанту: ");
        //Обчислення варіанту за допомогою іфиків
        String dod = "+ (додавання)";
        String vid = "- (віднімання)";
        String mnozh = "* (множення)";
        String dil = "/ (ділення)";
        String ostacha = "% (знаходження остачі від ділення)";
        //Операція О2
        if(c2 == 0) {
            System.out.println("У операції О1, мені потрібно виконати операцію: " + dod + ";");
        }
        else if(c2 == 1) {
            System.out.println("У операції О1, мені потрібно виконати операцію: " +  vid + ";");
        }
        //Не впевнений, що такий варіант можливий, але, про всяк, додав на випадок помилки з обрахуванням варіанту
        else System.out.println("Error (((");
        //Константа С
        System.out.println("Константа С = " + c3 + ";");
        //Операція О2
        if(c5 == 0) {
            System.out.println("У операції О2, мені потрібно виконати операцію: " + mnozh + ";");
        }
        else if(c5 == 1) {
            System.out.println("У операції О2, мені потрібно виконати операцію: " +  dil + ";");
        }
        else if (c5 == 2) {
            System.out.println("У операції О2, мені потрібно виконати операцію: " +  ostacha + ";");
        }
        else if (c5 == 3) {
            System.out.println("У операції О2, мені потрібно виконати операцію: " +  dod + ";");
        }
        else if (c5 == 4) {
            System.out.println("У операції О2, мені потрібно виконати операцію: " +  vid + ";");
        }
        //Теж зробив можливість виводу помилки
        else System.out.println("Error (((");
        //Визначення типів даних з якими потрібно буде працювати
        if (c7 == 0){
            System.out.println("Для обчислення значення функції, мені потрібно використати тип данних: byte" + ".");
        }
        else if (c7 == 1) {
            System.out.println("Для обчислення значення функції, мені потрібно використати тип данних: short" + ".");
        }
        else if (c7 == 2) {
            System.out.println("Для обчислення значення функції, мені потрібно використати тип данних: int" + ".");
        }
        else if (c7 == 3) {
            System.out.println("Для обчислення значення функції, мені потрібно використати тип данних: long" + ".");
        }
        else if (c7 == 4) {
            System.out.println("Для обчислення значення функції, мені потрібно використати тип данних: char" + ".");
        }
        else if (c7 == 5) {
            System.out.println("Для обчислення значення функції, мені потрібно використати тип данних: float" + ".");
        }
        else if (c7 == 6) {
            System.out.println("Для обчислення значення функції, мені потрібно використати тип данних: double" + ".");
        }
    }
}

